## Dimension Reduction

Dimensionality reduction refers to reducing the number of variables under consideration. Higher the number of variables harder it is to visualize the training data. Sometimes, most of feature or variables are correlated and hence are redundant. Common techniques used from dimensionality reduction are principle component analysis, etc

## Programming Question

In [16]:

import pandas as pd
df=pd.read_csv(r"file.csv")
df.drop_duplicates()

## Example

In [10]:
students_info=[('Abhay',12,'Maths'),
    ('Sanket',16,'Physics'),
    ('Abhay',12,'Maths'),
    ('Tara',14,'CS'),
    ('Nisha',15,'IT'),
    ('Abhay',12,'Maths'),
    ('Swapnil',17,'English'),
    ('Sneha',19,'Chemistry')
   ]
df=pd.DataFrame(students_info,columns=['Name','Age','Subject'])

In [11]:
df

      Name  Age    Subject
0    Abhay   12      Maths
1   Sanket   16    Physics
2    Abhay   12      Maths
3     Tara   14         CS
4    Nisha   15         IT
5    Abhay   12      Maths
6  Swapnil   17    English
7    Sneha   19  Chemistry

In [12]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
dtype: bool

In [15]:
df.drop_duplicates()

      Name  Age    Subject
0    Abhay   12      Maths
1   Sanket   16    Physics
3     Tara   14         CS
4    Nisha   15         IT
6  Swapnil   17    English
7    Sneha   19  Chemistry